#ifndef	__MSG_FORMAT_H__
#define __MSG_FORMAT_H__
#include  "rfid_type.h"
/*********************************
*		硬件设备查询指令命令帧
**********************************/
extern uint8 tHardwareCmd[8];
/*********************************
*		硬件设备查询响应
**********************************/
extern uint8 rHardwareInfo[18];
/*********************************
*		单次查询指令命令帧
**********************************/
extern uint8 tOnceCmd[7];

/*********************************
*		错误帧返回0x01 0xFF
**********************************/


/*********************************
*		查询指令返回信息帧[单、多共用]
**********************************/
extern R_answer_right_Type rQueryMsg;
/*********************************
*		查询100次命令帧
**********************************/
extern uint8 tPoll_20[10];
/*********************************
*		多次轮询停止命令帧
**********************************/
extern uint8 tPollStop[7];
/*********************************
*		多次轮询停止响应帧
**********************************/
extern uint8 rPollStop[8];


/*********************************
*		标签选择命令帧
**********************************/
extern T_select_command_Typedef tSelectCmd;
/*********************************
*		选择成功响应帧
**********************************/
extern uint8 rSelectOk[8];

/*********************************
*		读EPC存储区命令帧
**********************************/
extern T_read_EPC_Typedef tReadEPC;
/*********************************
*		读EPC存储区信息帧
**********************************/
extern R_read_EPC_Typedef rReadEPC;



/*********************************
*		写EPC存储区命令帧
**********************************/
extern T_write_EPC_Typedef tWriteEPC;

/*********************************
*		写标签存储区成功通知帧
**********************************/
extern R_write_right_Typedef rWriteOk;
/*********************************
*		写标签存储区失败错误帧
**********************************/
//extern uint8 R_write_error[8];
/*********************************
*		全局数据管理变量
**********************************/
extern MSG_stack_Typedef msgStack;
#endif